<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"47e097b9981907e860999d4a50c2ff87c06754e2f95238a4c1e494d9fa3f0200","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1139 at https://github.com/cal-itp/data-infra/actions/runs/19977333788","plan_out_hash":"fe47717ee832a12c2b97f6b77f4660a50908eba0047bcbf1e935ae391eb2cb31","plan_hash":"a3a63e71be1707586046a126d19e36fc6dc689a316bd266f126cae9302ac98e3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "XcMgKw==" -> (known after apply)
!~      detect_md5hash      = "cs6J44w9KE5zKtiq4EYrQw==" -> "different hash"
!~      generation          = 1764958906586741 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "cs6J44w9KE5zKtiq4EYrQw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "eQEchg==" -> (known after apply)
!~      detect_md5hash      = "ji0wGARPZVfr4tAxZDKDnw==" -> "different hash"
!~      generation          = 1764958908070109 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "ji0wGARPZVfr4tAxZDKDnw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1139](https://github.com/cal-itp/data-infra/actions/runs/19977333788)